In [3]:
import mysql.connector as db

In [4]:
dataBase = db.connect(host="localhost",
                      user="root",
                      passwd="g2l3b5@2002M")

print(dataBase)

dataBase.close

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001BEC4E44FA0>

## Creating DataBase

In [5]:
cursor = dataBase.cursor()

In [6]:
cursor.execute("Create DataBase Demo1")

In [7]:
dataBase.close()

## Creating Table

In [8]:
database= db.connect(
        host = "localhost",
        user = "root",
        password="g2l3b5@2002M",
        database = "demo1"
)

cursor = database.cursor()

In [9]:
student_record = '''
    CREATE TABLE STUDENT(
        STUDENT_ID INT NOT NULL AUTO_INCREMENT,
        NAME VARCHAR(30) NOT NULL,
        BRANCH  VARCHAR(30),
        ROLL_NUMBER VARCHAR(10) NOT NULL,
        SECTION VARCHAR(5),
        AGE INT,
        PRIMARY KEY(STUDENT_ID)
    )
'''

cursor.execute(student_record)

## INSERTING INTO TABLES

### `INSERTING SINGLE ROW`

In [10]:
command = """
    INSERT INTO STUDENT VALUES('1','MUTHU','CSE','2036','E','19')
"""

cursor.execute(command)

database.commit()

**Alternative Method**

In [11]:
command = "INSERT INTO STUDENT VALUES(%s,%s,%s,%s,%s,%s)"

value = ('2','PANDI','CSE','2037','E','19')

cursor.execute(command,value)

database.commit()

## INSERTING MULTIPLE ROWS

In [12]:
command = "INSERT INTO STUDENT(NAME,BRANCH,ROLL_NUMBER,SECTION,AGE) VALUES(%s,%s,%s,%s,%s)"

val = [("Nikhil", "CSE", "98", "A", "18"),
       ("Nisha", "CSE", "99", "A", "18"),
       ("Rohan", "MAE", "43", "B", "20"),
       ("Amit", "ECE", "24", "A", "21"),
       ("Anil", "MAE", "45", "B", "20"),
       ("Megha", "ECE", "55", "A", "22"),
       ("Sita", "CSE", "95", "A", "19")]

cursor.executemany(command,val)

database.commit()

## SELECT STATEMENT

In [13]:
cursor = database.cursor()

In [14]:
command = "SELECT * FROM STUDENT WHERE BRANCH='CSE'"

cursor.execute(command)

result =  cursor.fetchall()

print(result)

[(1, 'MUTHU', 'CSE', '2036', 'E', 19), (2, 'PANDI', 'CSE', '2037', 'E', 19), (3, 'Nikhil', 'CSE', '98', 'A', 18), (4, 'Nisha', 'CSE', '99', 'A', 18), (9, 'Sita', 'CSE', '95', 'A', 19)]

##  WHERE Statement

In [15]:
cursor.execute("SELECT  * FROM STUDENT WHERE BRANCH='CSE' AND AGE>=19")

result = cursor.fetchall()

for i in result:
    print(i)

(1, 'MUTHU', 'CSE', '2036', 'E', 19)
(2, 'PANDI', 'CSE', '2037', 'E', 19)
(9, 'Sita', 'CSE', '95', 'A', 19)

### Similary all other  queries like `Order_by` , `Update` etc.., can be used in the same manner

In [42]:
database.close()

In [53]:
database= db.connect(
        host = "localhost",
        user = "root",
        password="g2l3b5@2002M",
        database = "demo1"
)

cursor = database.cursor()

In [54]:
cursor.execute("Select * from Student")

c=cursor.fetchall()

database.close()

In [56]:
len(c)

9

<hr>